// - є масив [2,17,13,6,22,31,45,66,100,-18] :
let array = [2,17,13,6,22,31,45,66,100,-18];
// 1. перебрати його циклом while
// let u=0;
// while (u<array.length) {
//     console.log ( array[u] );
//     u++;
// }
//     2. перебрати його циклом for

// for (u=0; u<array.length; u++ ) {
//     console.log ( array[u] );
// }

//     3. перебрати циклом while та вивести  числа тільки з непарним індексом

// let u=0;
// while (u<array.length) {
//     if (u%2 !== 0) {
//         console.log (array[u]);
//     }
//     u++;
// }

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// for (u=0; u<array.length; u++) {
//     if (u % 2 !== 0) {
//         console.log (array[u]);
//     }
// }

// 5. перебрати циклом while та вивести  числа тільки парні  значення

// let u=0;
// while ( u<array.length) {
//     if (array[u]%2 === 0) {
//         console.log (array[u]);
//     }
//     u++;
// }

// 6. перебрати циклом for та вивести  числа тільки парні  значення

// for (u=0; u<array.length; u++) {
//     if (array[u]%2 === 0) {
//         console.log (array[u]);
//     }
// }

// 7. замінити кожне число кратне 3 на слово "okten"

// for (u=0; u<array.length; u++) {
//     if (array[u]%3 === 0) {
//         console.log (array[u]= 'okten');}
//         else {console.log (array[u]);
//     }
// }

// 8. вивести масив в зворотньому порядку.

// for (u=array.length-1; u>=0; u--) {
//     console.log(array[u]);
// }

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 9.1
// let u=array.length-1;
// while (u>=0) {
//     console.log ( array[u] );
//     u--;
// }

//9.3

// let u=array.length-1;
// while (u>=0) {
//     if (u%2 !== 0) {
//         console.log (array[u]);
//     }
//     u--;
// }

// 9.4

// for (u=array.length-1; u>=0; u--) {
//     if (u % 2 !== 0) {
//         console.log (array[u]);
//     }
// }

// 9.5

// let u=array.length-1;
// while ( u>=0) {
//     if (array[u]%2 === 0) {
//         console.log (array[u]);
//     }
//     u--;
// }
//
// 9.6

// for (u=array.length-1; u>=0; u--) {
//     if (array[u]%2 === 0) {
//         console.log (array[u]);
//     }
// }

// 9.7.
//
// let u=array.length-1;
// while ( u>=0) {
//     if (array[u]%3 === 0) {
//         console.log (array[u]= 'okten');}
//         else {console.log (array[u]);
// }
//     u--;
// }









// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор